<template>
    <pre><code class="nohighlight">

        |-- .nuxt/              # Папка создается при выполнении команды * npm run dev/build *
        |                       # содержит результирующие файлы при построении приложения
        |-- assets/             # Папка содержит нескомпилированные файлы с
        |                       # исходным кодом, такие как LESS, SASS или JavaScript
        |-- config/             # Базовые параметры конфигурации
        |-- docs/               # Папка создается при выполнении команды * npm run generate *
        |                       # содержит статические файлы веб-приложения для размещения на статическом хостинге
        |-- layouts/            # Папка содержит шаблоны приложения
        |-- middleware          # Папка содержит промежуточное программное обеспечение приложения
        |-- node_modules/       # Папка содержит * npm * библиотеки
        |-- pages/              # Папка содержит представления (views) и маршруты (routes)
        |-- plugins/            # Папка содержит JavaScript-плагины, запускаемые перед созданием экземпляра корневого приложения Vue.js
        |                       # а также другие JavaScript-библиотеки
        |-- static/             # Папка содержит статические файлы. Каждый файл в этой папке доступен через /
        |-- store/              # Папка содержит файлы Vuex хранилища
        |-- .gitignore
        |-- env.example.js      # Пример файла окружения
        |-- env.js              # Файл окружения
        |-- LICENSE.md
        |-- nuxt.config.js      # Файл  содержит пользовательскую конфигурацию Nuxt.js
        |-- package.json        # Файл содержит список зависимостей и команды для вашего приложения
        `-- README.md

    </code></pre>
</template>